Tobamalau/nrf52840/nRF5_SDK_15.3.0_59ac345/examples/peripheral/i2sTobi/main.c
/*#### TIMER ####*/
#if TIMER_ENABLE
   /*Timer Init*/
   uint32_t time_ms = 1; //Time(in miliseconds) between consecutive compare events.
   uint32_t time_ticks;
   //Configure TIMER for generating 1ms takt
   nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
   err = nrf_drv_timer_init(&TIMER, &timer_cfg, timer_event_handler);
   APP_ERROR_CHECK(err);
   time_ticks = nrf_drv_timer_ms_to_ticks(&TIMER, time_ms);

   nrf_drv_timer_extended_compare(
      &TIMER, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

   nrf_drv_timer_enable(&TIMER);
#endif
#if I2C_EN
   twi_init();
   TDA7901_set_mode();
#endif
}
uint8_t uarte_init()
{
    
    nrfx_uarte_config_t m_uart_config = {//= NRFX_UARTE_DEFAULT_CONFIG;
                      TX_PIN_NUMBER,               ///< TXD pin number.
                      RX_PIN_NUMBER,               ///< RXD pin number.
                      CTS_PIN_NUMBER,              ///< CTS pin number.
                      RTS_PIN_NUMBER,              ///< RTS pin number.
                      //NULL,
                      m_uart_context_callback,                        ///< Context passed to interrupt handler.
                      UARTE_CONFIG_HWFC_Disabled,              ///< Flow control configuration.
                      UARTE_CONFIG_PARITY_Excluded,            ///< Parity configuration.
                      UARTE_BAUDRATE_BAUDRATE_Baud460800,      ///< Baudrate.
                      NRFX_UARTE_DEFAULT_CONFIG_IRQ_PRIORITY,  ///< Interrupt priority.
    };
    return nrfx_uarte_init(&m_uart, &m_uart_config, m_uart_callback);
}
void IEEE802154_init(uint8_t *message)
{
   uint8_t extended_address[] = {0x01, 0x23, 0x45, 0x67, 0x89, 0xab, 0xcd, 0xef};
   uint8_t short_address[]    = {0x78, 0x56};
   uint8_t pan_id[]           = {0x34, 0x12};

   memset( message, 0, sizeof(message));
   setMacHead(message);
   IEEE802154_tx_in_progress = false;
   IEEE802154_tx_done        = false;

   nrf_802154_init();
   nrf_802154_auto_pending_bit_set(false);
   nrf_802154_auto_ack_set(false);
   nrf_802154_short_address_set(short_address);
   nrf_802154_extended_address_set(extended_address);
   nrf_802154_pan_id_set(pan_id);
   nrf_802154_channel_set(IEEECHANNEL);
   nrf_802154_receive();
   nrf_802154_tx_power_set(8);
}
void stopI2S()
{
   IEEEReciveActiv = false;
   I2sInProgress = false;
#if !I2SHAL
   nrf_drv_i2s_stop();
#else
   NRF_I2S->EVENTS_TXPTRUPD = 0;
   NRF_I2S->TASKS_START = 0;
   NRF_I2S->TASKS_STOP = 1;
   *((volatile uint32_t *)0x40025038) = 1;/*Workaround for sdk issu*/
   *((volatile uint32_t *)0x4002503C) = 1;
#endif
   nrfx_uarte_rx(&m_uart, rxUarteBuffer[ReciveBufferPos], sizeof(rxUarteBuffer[ReciveBufferPos]));
                  
}
void setMacHead(uint8_t *message)
{
   message[0] = 0x41;                // Set MAC header: short addresses, no ACK 0100 0001
   message[1] = 0x98;                // Set MAC header 1001 1000
   message[3] = DESTINATIONPAN&0xff;
   message[4] = (DESTINATIONPAN>>8)&0xff;
   message[5] = DESTINATION&0xff;
   message[6] = (DESTINATION>>8)&0xff;
   message[7] = SOURCE&0xff;
   message[8] = (SOURCE>>8)&0xff;
}
void sendStateToUart(char id)
{
   memset( txBuffer, 0, sizeof(txBuffer));
   int length = sprintf(txBuffer, "r%c%d%d%d\t%d\t%d\t%d", id, DecodeBufferPos, ReciveBufferLoad, ReciveBufferPos, timeIEEEsent, timeNewFrameSeq, timelastI2SLoop);
   if(id == 'I')
      txBuffer[length] = '\n';
   UarteInRecive = true;
   nrfx_uarte_rx(&m_uart, rxUarteBuffer[ReciveBufferPos], sizeof(rxUarteBuffer[ReciveBufferPos]));      
   nrfx_uarte_tx(&m_uart, (uint8_t *)txBuffer, UARTE_TX_BUFF_SIZE);
}
void nrf_802154_transmitted(const uint8_t * p_frame, uint8_t * p_ack, uint8_t length, int8_t power, uint8_t lqi)
{
   (void) p_frame;
   (void) length;
   (void) power;
   (void) lqi;
   timeIEEEsent = timerCnt;
   IEEE802154_tx_done = true;
   nrf_gpio_pin_toggle(BSP_LED_0);
   opusPackNb++;
   Counter32[_IEEETRANSMITTED]++;
   if (p_ack != NULL)
   {
     nrf_802154_buffer_free(p_ack);
   }
}
void nrf_802154_transmit_failed(const uint8_t * p_frame, nrf_802154_tx_error_t error)
{
   IEEE802154_tx_done = true;
   Counter16[_IEEETRANSFAILED]++;
}
void nrf_802154_cca_failed(nrf_802154_cca_error_t error)
{
   IEEE802154_tx_done = true;
   Counter16[_IEEECCAFAILED]++;
}
void nrf_802154_received(uint8_t * p_data, uint8_t length, int8_t power, uint8_t lqi)
{
   (void) power;
   (void) lqi;

   if (length > MAX_MESSAGE_SIZE + 2 || IEEE802154_tx_done || !isOpusPacket(p_data+MACHEAD, (length - MACHEAD - 2)))
     goto exit;
   memcpy(rxUarteBuffer[ReciveBufferPos], p_data + MACHEAD, (PAYLOAD + OPUSPACKHEAD));
   PacketNum = rxUarteBuffer[ReciveBufferPos][1];
   //ReciveBufferLoad |= (1 << ReciveBufferPos); //new decode Buffer available
   ReciveBufferLoad++;
   //ReciveBufferPos ^= (1 << 0);            //ReciveBufferLoad &= ~(1 << ReciveBufferPos) löschen 
   toggleBuffer(&ReciveBufferPos);   
   timeIEEEsent = timerCnt;

   if(!State)
      State = 2;
   
   nrf_gpio_pin_toggle(BSP_LED_1);
   Counter32[_IEEERECIVED]++;
   IEEEReciveActiv = true;
   PacketIsLost = false;
   nrfx_uarte_rx_abort(&m_uart); //uart recive turn off

   
   memset( txBuffer2, 0, sizeof(txBuffer2));
   sprintf(txBuffer2, "RecTimeSt:%d\tPacketNum:%d\n", timerTotalCnt, PacketNum);
   nrfx_uarte_tx(&m_uart, (uint8_t *)txBuffer2, sizeof(txBuffer2));
   
exit:
   nrf_802154_buffer_free(p_data);

   return;
}
#if TIMER_ENABLE
/**
 * @brief Handler for timer events.
 */
void timer_event_handler(nrf_timer_event_t event_type, void* p_context)
{
   switch (event_type)
   {
     case NRF_TIMER_EVENT_COMPARE0:
         timerCnt++;
         timerTotalCnt++;
         if(timerCnt == 1000)
            timerCnt = 0;
         if(timerTotalCnt == 50000)
            timerTotalCnt = 0;
         break;

     default:
         //Do nothing.
         break;
   }
}
#endif
// Interrupt handler
void GPIOTE_IRQHandler()
{
   memset( txBuffer, 0, sizeof(txBuffer));
   int length = sprintf(txBuffer, "lostP%d;ConInt%d", Counter16[_IEEELOSTPACKET], Counter16[_IEEECONINTERRUPT]);
   txBuffer[length] = '\n';
   nrfx_uarte_tx(&m_uart, (uint8_t *)txBuffer, UARTE_TX_BUFF_SIZE);
   NRF_GPIOTE->EVENTS_IN[0] = 0;
   nrf_gpio_pin_toggle(BSP_LED_3);

