Tobamalau/nrf52840/nRF5_SDK_15.3.0_59ac345/examples/peripheral/i2sTobi/main.c
}
#if !I2SHAL
static void i2sdata_handler(nrf_drv_i2s_buffers_t const * p_released, uint32_t status)
{
   ASSERT(p_released);
   if (!(status & NRFX_I2S_STATUS_NEXT_BUFFERS_NEEDED))
     return;

   timelastI2SLoop = timerCnt; 
   if(timelastI2SLoop == 0)
     timerCnt = 0; 
   timerCnt = 0;
   timeNewFrameSeq = 0;
   timeIEEEsent = 0;
   nrf_drv_i2s_buffers_t const next_buffers = {
      //.p_rx_buffer = NULL,
      .p_tx_buffer = (uint32_t *)OpusInstanz.pcm_bytes[bufferNr],
   };
   APP_ERROR_CHECK(nrf_drv_i2s_next_buffers_set(&next_buffers));

   State = 2;
   toggleBuffer(&bufferNr);
}
#endif
void m_uart_callback(nrfx_uarte_event_t const * p_event, void * p_context)
{
   switch(p_event->type)
   {
      case NRFX_UARTE_EVT_TX_DONE:  
         break;

      case NRFX_UARTE_EVT_RX_DONE: 
         if(!isOpusPacket(rxUarteBuffer[ReciveBufferPos], UARTE_RX_BUFF_SIZE) || IEEEReciveActiv)
         {
            nrfx_uarte_rx_abort(&m_uart); 
            nrfx_uarte_rx(&m_uart, rxUarteBuffer[ReciveBufferPos], sizeof(rxUarteBuffer[ReciveBufferPos]));
            break;
         }
         PacketNum = rxUarteBuffer[ReciveBufferPos][1];
         UarteInRecive = false;
         //ReciveBufferLoad |= (1 << ReciveBufferPos); //new decode Buffer available
         ReciveBufferLoad++;
         //ReciveBufferPos ^= (1 << 0);            //ReciveBufferLoad &= ~(1 << ReciveBufferPos) löschen   
         toggleBuffer(&ReciveBufferPos);       
         if(ReciveBufferLoad < 2)
            sendStateToUart('E');
         if(!State && ReciveBufferLoad > 1)
            State = 2;
         break;

      case NRFX_UARTE_EVT_ERROR:
         break;      
   }
}
void m_uart_context_callback()
{

}
void toggleBuffer(volatile uint8_t *buffer)
{
   (*buffer)++;
   if(*buffer == 3)
      *buffer = 0;
}
int main(void)
{
   initPeripheral();

   uint8_t IEEE802154_message[MAX_MESSAGE_SIZE];
   IEEE802154_init(IEEE802154_message);
 
   struct frame FrameInstanz = {&OpusInstanz, 0, 0};
   initOpusFrame(&FrameInstanz);

   uint8_t lastPacketRec = 0; 
   uint16_t lastLostPacketCnt = 0; 

   UarteInRecive = true;
   nrfx_uarte_rx(&m_uart, rxUarteBuffer[ReciveBufferPos], sizeof(rxUarteBuffer[ReciveBufferPos]));
   while (1)
   {
      /*### Statemachine ###*/
      switch(State)
      {
         case 0:  //Idle I2S Off
            break;
         case 1:  //Wait
            /* New I2S buffer*/
            if(NRF_I2S->EVENTS_TXPTRUPD  != 0)
            {
               timelastI2SLoop = timerCnt; 
               if(timelastI2SLoop == 0)
                 timerCnt = 0; 
               timerCnt = 0;
               NRF_I2S->TXD.PTR = (uint32_t)OpusInstanz.pcm_bytes[bufferNr];
               toggleBuffer(&bufferNr);
               NRF_I2S->EVENTS_TXPTRUPD = 0;
               State++;
            } 
            break;
         case 2:  //Buffer check
            if(!ReciveBufferLoad)   //No Buffer
            {
               if(IEEEReciveActiv)
               {
                  if((Counter16[_IEEELOSTPACKET]-lastLostPacketCnt < MAXLOSTPACKETS))
                  {
                     toggleBuffer(&bufferNr);                 //switch to latest Buffer
                     if(Counter16[_IEEELOSTPACKET] == lastLostPacketCnt)
                     {
                        lastPacketRec = PacketNum;
                     }
                     Counter16[_IEEELOSTPACKET]++;
                     memset( txBuffer2, 0, sizeof(txBuffer2));
                     sprintf(txBuffer2, "Timestamp:%d\tLostPack:%d\n", timerTotalCnt, Counter16[_IEEELOSTPACKET]);
                     nrfx_uarte_tx(&m_uart, (uint8_t *)txBuffer2, sizeof(txBuffer2));
                     State = 6;
                  }
                  else
                  {
                     Counter16[_IEEECONINTERRUPT]++;
                     stopI2S();
                     State = 0;
                  }
               }
               else
               {
                  nrfx_uarte_rx_abort(&m_uart); 
                  stopI2S(); 
                  State = 0;
               }
               nrf_gpio_pin_toggle(BSP_LED_2);
               
            }   
            else  //Buffer available
            {
               if(lastLostPacketCnt != Counter16[_IEEELOSTPACKET])
               {
                  memset( txBuffer2, 0, sizeof(txBuffer2));
                  sprintf(txBuffer2, "LastPack: %d\tNewPack:%d\tLost:%d\tNotready:%d\tTotRec:%ld\n", lastPacketRec, PacketNum, (PacketNum-lastPacketRec-1), Counter16[_IEEENOTREADY], Counter32[_IEEERECIVED]);
                  nrfx_uarte_tx(&m_uart, (uint8_t *)txBuffer2, sizeof(txBuffer2));
                  lastLostPacketCnt = Counter16[_IEEELOSTPACKET];
               }
               lastPacketRec = 0;
               if(!isOpusPacket(rxUarteBuffer[DecodeBufferPos], UARTE_RX_BUFF_SIZE))
                  State = 6;
               else if(IEEEReciveActiv)
                  State = 4;
               else
                  State = 3;
            }
            break;

         case 3:  /*### IEEE802.15.4 transmitt ###*/         
            if (!IEEE802154_tx_in_progress && !IEEEReciveActiv)
            {
               memcpy(IEEE802154_message+MACHEAD ,rxUarteBuffer[DecodeBufferPos], (PAYLOAD + OPUSPACKHEAD));
               IEEE802154_message[2] = opusPackNb;
               IEEE802154_tx_in_progress = true;
               nrf_802154_transmit_csma_ca(IEEE802154_message, (uint8_t)MAX_MESSAGE_SIZE);
               if(opusPackNb == 0xff)
                  opusPackNb = 0;
               State = 4;
            }
            else if(lastPacketRec != opusPackNb)   //just for debugging
            {
               Counter16[_IEEENOTREADY]++;  
               lastPacketRec = opusPackNb;
            }
            break;

         case 4:  /*### Decode Frame ###*/
            FrameInstanz.opus_t->input = rxUarteBuffer[DecodeBufferPos] + 4;
            FrameInstanz.opus_t->nbBytes = UARTE_RX_BUFF_SIZE - 4;  
            //ReciveBufferLoad &= ~(1 << DecodeBufferPos);                   //Delet Bufferloadmemory
            ReciveBufferLoad--;
            //DecodeBufferPos ^= (1 << 0);                                   //switch to new Uart Buffer
            toggleBuffer(&DecodeBufferPos);

            /*new buffer request from Uarte*/
            if(!UarteInRecive && !IEEEReciveActiv)
               sendStateToUart('W');

            if(!getPcm(&FrameInstanz, bufferNr))
               APP_ERROR_CHECK(NRF_ERROR_BUSY);
            if(!I2sInProgress)
               State = 5;
            else
               State = 6;
            break;         

         case 5:  /*### Start I2S ###*/
#if !I2SHAL
            nrf_drv_i2s_buffers_t const initial_buffers = {
               .p_tx_buffer = (uint32_t *)OpusInstanz.pcm_bytes[bufferNr],
               //.p_rx_buffer = NULL,
            };
            APP_ERROR_CHECK(nrf_drv_i2s_start(&initial_buffers, FRAME_SIZE/2, 0));
#else
            NRF_I2S->TXD.PTR = (uint32_t)OpusInstanz.pcm_bytes[bufferNr];
            NRF_I2S->RXTXD.MAXCNT = FRAME_SIZE/2;
            NRF_I2S->TASKS_START = 1;
#endif
            I2sInProgress = true;
            toggleBuffer(&bufferNr);
            State = 6;
            break;

         case 6:  /*### Sequence End ###*/
            timeNewFrameSeq = timerCnt;
            State = 1;
            break;                      
      }

      /*IEEE802.15.4 transmitted*/
      if (IEEE802154_tx_done)
      {
         IEEE802154_tx_in_progress = false;
         IEEE802154_tx_done   = false;
      }
      if(!nrf_gpio_pin_read(BSP_BUTTON_1))
      {
         memset( Counter16, 0, sizeof(Counter16)); 
         memset( Counter32, 0, sizeof(Counter32));
      }
   }
}
